Repository: looizinho/Side-Search
Catalog: Localizable.xcstrings
Source language: en
Languages: ja, pt_br

source: About
ja: 情報
pt_br: Sobre

source: AI Assistants
ja: AIアシスタント
pt_br: Assistentes de IA

source: Allow in Settings
ja: 設定で許可する
pt_br: Permitir nos Ajustes

source: Allow Notifications
ja: 通知を許可する
pt_br: Permitir Notificações

source: Always On
ja: 常にオン
pt_br: Sempre Ativo

source: API Key
ja: APIキー
pt_br: Chave de API

source: Ask Assistant
ja: アシスタントに質問
pt_br: Perguntar ao Assistente

source: Assistant
ja: アシスタント
pt_br: Assistente

source: Assistant is Off
ja: アシスタントオフ
pt_br: Assistente Desativado

source: Assistants
ja: アシスタント
pt_br: Assistentes

source: Authentication Key
ja: 認証鍵
pt_br: Chave de Autenticação

source: Background Only
ja: バックグラウンドのみ
pt_br: Apenas em Segundo Plano

source: Background Settings
ja: バックグラウンドの設定
pt_br: Ajustes de Segundo Plano

source: Background Tip
ja: バックグラウンドのヒント
pt_br: Dica de Segundo Plano

source: By keeping the microphone on, you can have the assistant standby in the background. While in standby, you can use the Side Button or Action Button to resume the assistant without opening the app.
ja: マイクをオンにし続けることで、アシスタントをバックグラウンドで待機させることができます。待機中はサイドボタンやアクションボタンなどを使用して、アプリを開かずにアシスタントを再開できます。
pt_br: Ao manter o microfone ativado, você pode deixar o assistente em espera em segundo plano. Enquanto estiver em espera, use o Botão Lateral ou o Botão de Ação para retomar o assistente sem abrir o app.

source: By setting the query part to "%s", you can use Side Search's speech recognition.
ja: クエリ部分を「%s」にすると、Side Searchの音声認識を利用できます。
pt_br: Ao definir a parte da consulta como "%s", você pode usar o reconhecimento de voz do Side Search.

source: By setting up automation, you can also perform other actions when Side Search is launched. I recommend turning on "Start with Mic Muted".
ja: オートメーションを設定すれば、Side Searchを起動した時に別のアクションを実行することもできます。「マイクミュートで開始」をオンにすることをおすすめします。
pt_br: Ao configurar uma automação, você também pode executar outras ações quando o Side Search for iniciado. Recomenda-se ativar "Iniciar com microfone mudo".

source: Cancel
ja: キャンセル
pt_br: Cancelar

source: Change App Icon
ja: アイコンを変更
pt_br: Alterar Ícone do App

source: Chat History
ja: チャット履歴
pt_br: Histórico de Conversas

source: Check pricing and available models...
ja: 価格と利用可能なモデルを確認...
pt_br: Verificar preços e modelos disponíveis...

source: Check your rate limits...
ja: レート制限を確認…
pt_br: Verificar limites de uso...

source: Clear
ja: 削除
pt_br: Limpar

source: Clear All
ja: 全て削除
pt_br: Limpar Tudo

source: Clear All Chat History
ja: 全てのチャット履歴を削除
pt_br: Limpar Todo o Histórico de Conversas

source: Clear In-App Browser Data
ja: アプリ内ブラウザのデータを削除
pt_br: Limpar Dados do Navegador no App

source: Close
ja: 閉じる
pt_br: Fechar

source: Close Curtain
ja: カーテンを閉じる
pt_br: Fechar Cortina

source: Confirm
ja: 完了
pt_br: Confirmar

source: Continue in Background
ja: バックグラウンドで継続
pt_br: Continuar em Segundo Plano

source: Copilot Search
ja: Copilot検索
pt_br: Pesquisa Copilot

source: Copy Message to Clipboard
ja: メッセージをクリップボードにコピー
pt_br: Copiar Mensagem para a Área de Transferência

source: Copy URL
ja: URLをコピー
pt_br: Copiar URL

source: Create a new personal automation in Shortcuts
ja: 「ショートカット」で新規パーソナルオートメーションを作成する
pt_br: Criar uma nova automação pessoal no Atalhos

source: Custom Instructions
ja: カスタム指示
pt_br: Instruções Personalizadas

source: Default App
ja: デフォルトのアプリ
pt_br: App Padrão

source: Delete
ja: 削除
pt_br: Apagar

source: Developer
ja: 開発者
pt_br: Desenvolvedor

source: Disable Markdown Rendering
ja: マークダウンの表示を無効にする
pt_br: Desativar Renderização de Markdown

source: Dismiss Keyboard
ja: キーボードを閉じる
pt_br: Ocultar Teclado

source: Enable Chat History
ja: チャット履歴を有効化
pt_br: Ativar Histórico de Conversas

source: Enable Web Search
ja: Web検索を有効にする
pt_br: Ativar Pesquisa na Web

source: End Assistant
ja: アシスタントを終了
pt_br: Encerrar Assistente

source: End the Side Search assistant if it's active.
ja: Side Searchのアシスタントを使用中の場合、終了します。
pt_br: Encerra o assistente do Side Search se estiver ativo.

source: Endpoint URL
ja: エンドポイントのURL
pt_br: URL do Endpoint

source: Enter the authentication key if the endpoint requires authentication. Leave it blank if not required.
ja: エンドポイントで認証が必要な場合は認証鍵を入力します。不要な場合は空にします。
pt_br: Insira a chave de autenticação se o endpoint exigir autenticação. Deixe em branco se não for necessário.

source: Enter the URL for your custom Side Bridge endpoint.
ja: あなたのカスタムSide BridgeエンドポイントのURLを入力します。
pt_br: Insira a URL para o seu endpoint personalizado do Side Bridge.

source: Error
ja: エラー
pt_br: Erro

source: Failed to prepare speech recognition.
ja: 音声認識の準備に失敗しました。
pt_br: Falha ao preparar o reconhecimento de voz.

source: Failed to start recording: %@
ja: 録音開始に失敗しました: %@
pt_br: Falha ao iniciar a gravação: %@

source: for "%@".
ja: 対象: "%@"
pt_br: para "%@".

source: Gemini API Key
ja: Gemini APIキー
pt_br: Chave de API do Gemini

source: Get API Key...
ja: APIキーを入手…
pt_br: Obter Chave de API...

source: Google AI Mode
ja: Google AIモード
pt_br: Modo Google AI

source: Help
ja: ヘルプ
pt_br: Ajuda

source: If you allow notifications, you can receive the assistant's replies via notifications.
ja: 通知を許可すれば、アシスタントの返事を通知で確認することができます。
pt_br: Se você permitir notificações, poderá receber as respostas do assistente por meio de notificações.

source: If you are in a region where Side Button customization is enabled, you can quickly launch the Side Search assistant by pressing and holding the Side Button.
ja: サイドボタンのカスタマイズが可能な地域では、サイドボタンを長押しすることでSide Searchのアシスタントをすぐに起動できます。
pt_br: Se você estiver em uma região onde a personalização do Botão Lateral está ativada, poderá iniciar rapidamente o assistente do Side Search mantendo o Botão Lateral pressionado.

source: If you select Default App, the app associated with the URL or your default browser will open.
ja: デフォルトのアプリを選択すると、URLと関連するアプリか、デフォルトのブラウザが開かれます。
pt_br: Se você selecionar App Padrão, o app associado à URL ou seu navegador padrão será aberto.

source: In-App Browser
ja: アプリ内ブラウザ
pt_br: Navegador no App

source: Invalid Search URL. Please check your settings.
ja: 検索URLが無効です。設定を確認してください。
pt_br: URL de pesquisa inválida. Verifique seus ajustes.

source: Keep on Standby
ja: 待機させる
pt_br: Manter em Espera

source: Language
ja: 言語
pt_br: Idioma

source: Learn more about Side Bridge...
ja: Side Bridgeの詳細…
pt_br: Saiba mais sobre o Side Bridge...

source: License
ja: ライセンス
pt_br: Licença

source: Licenses
ja: 権利表記
pt_br: Licenças

source: Listening...
ja: 聞いています…
pt_br: Ouvindo...

source: Manually Confirm
ja: 手動で完了する
pt_br: Confirmar Manualmente

source: Microphone access denied. Please enable it in Settings.
ja: マイクへのアクセスが拒否されています。設定で有効にしてください。
pt_br: Acesso ao microfone negado. Ative-o nos Ajustes.

source: Mode
ja: モード
pt_br: Modo

source: Model
ja: モデル
pt_br: Modelo

source: No Results
ja: 結果なし
pt_br: Nenhum Resultado

source: Notifications allowed.
ja: 通知は許可されています。
pt_br: Notificações permitidas.

source: Off
ja: オフ
pt_br: Desativado

source: Open in Default App
ja: デフォルトのアプリで開く
pt_br: Abrir no App Padrão

source: Open Settings
ja: 設定を開く
pt_br: Abrir Ajustes

source: Open Shortcuts App
ja: ショートカットアプリを開く
pt_br: Abrir App Atalhos

source: Open URLs in
ja: 次でURLを開く
pt_br: Abrir URLs em

source: Open URLs in ${option}
ja: URLを ${option} で開くように設定
pt_br: Abrir URLs em ${option}

source: Option
ja: オプション
pt_br: Opção

source: Please check the available models and features for your plan.
ja: ご利用のプランで利用可能なモデルと機能をご確認ください。
pt_br: Verifique os modelos e recursos disponíveis para o seu plano.

source: Please get and enter your API key from Google AI Studio. You can also use a free tier API key.
ja: Google AI StudioでAPIキーを取得して入力してください。無料枠のAPIキーでも利用できます。
pt_br: Obtenha e insira sua chave de API do Google AI Studio. Você também pode usar uma chave do nível gratuito.

source: Privacy Policy
ja: プライバシーポリシー
pt_br: Política de Privacidade

source: Recognition Paused
ja: 音声認識停止中
pt_br: Reconhecimento Pausado

source: Run a shortcut using a URL scheme
ja: URLスキームを使用してショートカットを実行する
pt_br: Executar um atalho usando um esquema de URL

source: Search Engines
ja: 検索エンジン
pt_br: Mecanismos de Busca

source: Search URL
ja: 検索URL
pt_br: URL de Pesquisa

source: Search URL Presets
ja: 検索URLのプリセット
pt_br: Predefinições de URL de Pesquisa

source: Search URL Tip
ja: 検索URLのヒント
pt_br: Dica da URL de Pesquisa

source: Select a model
ja: モデルを選択
pt_br: Selecione um modelo

source: Set Assistant
ja: アシスタントを設定
pt_br: Definir Assistente

source: Set Assistant to ${type}
ja: アシスタントを ${type} に設定
pt_br: Definir assistente para ${type}

source: Set Continue in Background
ja: 「バックグラウンドで継続」を設定
pt_br: Definir Continuar em Segundo Plano

source: Set Continue in Background to ${value}
ja: 「バックグラウンドで継続」を ${value} に設定
pt_br: Definir Continuar em Segundo Plano como ${value}

source: Set Keep on Standby in Background
ja: バックグラウンドで「待機させる」設定を変更
pt_br: Definir Manter em Espera em Segundo Plano

source: Set Keep on Standby in Background to ${value}
ja: バックグラウンドで「待機させる」設定を ${value} に変更
pt_br: Definir Manter em Espera em Segundo Plano como ${value}

source: Set Sound Effects Mode
ja: 効果音のモードを設定
pt_br: Definir Modo dos Efeitos Sonoros

source: Set Sound Effects Mode to ${mode}
ja: 効果音のモードを ${mode} に設定
pt_br: Definir modo dos efeitos sonoros para ${mode}

source: Set Start with Mic Muted
ja: 「マイクミュートで開始」を設定
pt_br: Definir Iniciar com Microfone Mudo

source: Set Start with Mic Muted to ${value}
ja: 「マイクミュートで開始」を ${value} に設定
pt_br: Definir Iniciar com Microfone Mudo como ${value}

source: Set URL Opening Option
ja: URLを開くオプションを設定
pt_br: Definir Opção de Abertura de URLs

source: Sets the assistant to be used in Side Search.
ja: Side Searchで使用するアシスタントを設定します。
pt_br: Define o assistente a ser usado no Side Search.

source: Sets the Side Search setting.
ja: Side Searchの設定を変更します。
pt_br: Define os ajustes do Side Search.

source: Share URL
ja: URLを共有
pt_br: Compartilhar URL

source: Shortcut Tip
ja: ショートカットのヒント
pt_br: Dica do Atalhos

source: Side Button Tip
ja: サイドボタンのヒント
pt_br: Dica do Botão Lateral

source: Sound Effects
ja: 効果音
pt_br: Efeitos Sonoros

source: Sound Effects Mode
ja: 効果音のモード
pt_br: Modo dos Efeitos Sonoros

source: Source
ja: ソースコード
pt_br: Código-Fonte

source: Speak
ja: 話す
pt_br: Falar

source: Speech recognition is not available in the selected language or on this device.
ja: 音声認識は、選択した言語で利用できないか、このデバイスで利用できません。
pt_br: O reconhecimento de voz não está disponível no idioma selecionado ou neste dispositivo.

source: Speech recognition stopped: %@
ja: 音声認識が停止しました: %@
pt_br: O reconhecimento de voz parou: %@

source: Speech Settings
ja: 音声認識の設定
pt_br: Ajustes de Reconhecimento de Voz

source: Start Assistant
ja: アシスタントを開始
pt_br: Iniciar Assistente

source: Start Speech Recognition
ja: 音声認識を開始
pt_br: Iniciar Reconhecimento de Voz

source: Start the Side Search assistant.
ja: Side Searchのアシスタントを開始します。
pt_br: Inicia o assistente do Side Search.

source: Start with Mic Muted
ja: 開始時にマイクをオフ
pt_br: Iniciar com Microfone Mudo

source: Stop
ja: 止める
pt_br: Parar

source: Stop Microphone
ja: マイクを停止
pt_br: Parar Microfone

source: Submit
ja: 送信
pt_br: Enviar

source: Switch Assistant
ja: アシスタントの切り替え
pt_br: Trocar de Assistente

source: System
ja: システム
pt_br: Sistema

source: The assistant has ended the conversation.
ja: アシスタントが会話を終了しました。
pt_br: O assistente encerrou a conversa.

source: The confirmed supported region is Japan only.
ja: 現在確認されている対応地域は、日本のみです。
pt_br: A região com suporte confirmado atualmente é apenas o Japão.

source: The Search URL is necessary to set your preferred AI assistant or search engine URL.
ja: 検索URLは、お好みのAIアシスタントや検索エンジンのURLを設定するために必要です。
pt_br: A URL de pesquisa é necessária para definir a URL do seu assistente de IA ou mecanismo de busca preferido.

source: This assistant is AI and can make mistakes.
ja: このアシスタントはAIであるため、間違えることがあります。
pt_br: Este assistente é uma IA e pode cometer erros.

source: This assistant is not available.
ja: このアシスタントは利用できません。
pt_br: Este assistente não está disponível.

source: This can be used by setting URLs for AI assistants, search engines, etc. The assistant will open in the in-app browser or the default app. Side Search's speech recognition is optional.
ja: AIアシスタントや検索エンジンなどのURLを設定して使用するアシスタントです。アシスタントはアプリ内ブラウザかデフォルトのアプリで開きます。Side Searchの音声認識はオプションです。
pt_br: Pode ser usado definindo URLs para assistentes de IA, mecanismos de busca, etc. O assistente abrirá no navegador do app ou no app padrão. O reconhecimento de voz do Side Search é opcional.

source: This is an assistant that can converse and search using Gemini provided by Google. To use it, you need to obtain an API key yourself from Google AI Studio. You are responsible for managing the costs and agreements related to your usage.
ja: Googleの提供するGeminiを使用して会話と検索を行うことができるアシスタントです。使用するにはご自身でGoogle AI StudioでAPIキーを取得する必要があります。利用にかかるコストや同意する規約などは、ご自身で管理していただく必要があります。
pt_br: Este é um assistente que conversa e realiza pesquisas usando o Gemini do Google. Para utilizá-lo, você precisa obter uma chave de API no Google AI Studio. Você é responsável pelos custos e termos de uso associados.

source: This is an assistant that can converse using Foundation Models provided by Apple. To use it, Apple Intelligence must be available on your device. This assistant cannot search the internet.
ja: Appleの提供するFoundation Modelsを使用して会話を行うことができるアシスタントです。使用するにはデバイスでApple Intelligenceが利用可能である必要があります。このアシスタントではインターネット上を検索することはできません。
pt_br: Este é um assistente capaz de conversar usando Foundation Models da Apple. Para utilizá-lo, o Apple Intelligence deve estar disponível no seu dispositivo. Este assistente não pode realizar buscas na internet.

source: This will clear all chat history. This action cannot be undone.
ja: すべてのチャットの履歴を削除します。この操作は元に戻せません。
pt_br: Isso apagará todo o histórico de conversas. Esta ação não pode ser desfeita.

source: This will clear all in-app browser data, including cookies and cache.
ja: クッキーやキャッシュを含む、すべてのアプリ内ブラウザのデータが削除されます。
pt_br: Isso apagará todos os dados do navegador no app, incluindo cookies e cache.

source: Tools
ja: ツール
pt_br: Ferramentas

source: Translate Message
ja: メッセージを翻訳
pt_br: Traduzir Mensagem

source: Unknown
ja: 不明
pt_br: Desconhecido

source: Unknown microphone authorization status.
ja: 不明なマイクの認証ステータスです。
pt_br: Status de autorização do microfone desconhecido.

source: URL Opening Option
ja: URLを開くオプション
pt_br: Opção de Abertura de URL

source: URL Settings
ja: URLの設定
pt_br: Ajustes de URL

source: Use Bluetooth Microphones
ja: Bluetoothマイクを使用
pt_br: Usar Microfones Bluetooth

source: Version
ja: バージョン
pt_br: Versão

source: Waiting for Assistant...
ja: アシスタントを待機中…
pt_br: Aguardando o assistente...

source: With a compatible assistant, you can continue conversations in the background even if you close Side Search during speech recognition.
ja: 対応するアシスタントでは、音声認識中にアプリを閉じてもバックグラウンドで会話を続けることができます。
pt_br: Com um assistente compatível, você pode continuar conversas em segundo plano mesmo fechando o Side Search durante o reconhecimento de voz.

source: You
ja: あなた
pt_br: Você

source: You can create and use your own endpoint called Side Bridge, which serves as a bridge between any conversational assistant and Side Search. This is for advanced users.
ja: 任意の会話型アシスタントとSide Searchの架け橋となる、Side Bridgeと呼ばれるエンドポイントをご自身で作成して利用できます。高度なユーザー向けです。
pt_br: Você pode criar e usar seu próprio endpoint chamado Side Bridge, que serve como uma ponte entre qualquer assistente conversacional e o Side Search. Recurso voltado para usuários avançados.

source: You can launch the Side Search assistant using the Shortcuts.
ja: ショートカットを使ってSide Searchのアシスタントを起動することができます。
pt_br: Você pode iniciar o assistente do Side Search usando o app Atalhos.

source: You can set it up by going to Settings → Apps → Side Search and turning on "Press Side Button for Side Search".
ja: 設定 → アプリ → Side Searchで「サイドボタンを押してSide Searchを使用」をオンにすることで設定できます。
pt_br: Você pode configurar acessando Ajustes → Apps → Side Search e ativando "Pressionar Botão Lateral para Side Search".

source: You can use the app's URL scheme for the Search URL. If you set the assistant to Open in Default App, you can also use Universal Links.
ja: 検索URLにはアプリのURLスキームを使用することができます。アシスタントをデフォルトのアプリで開くように設定すれば、ユニバーサルリンクも使用できます。
pt_br: Você pode usar o esquema de URL do app para a URL de Pesquisa. Se você configurar o assistente para Abrir no App Padrão, também poderá usar Universal Links.

source: Яндекс
ja: Yandex
pt_br: Yandex

source: 百度
ja: バイドゥ
pt_br: Baidu

source: 百度AI搜索
ja: バイドゥAI検索
pt_br: Busca com IA Baidu

# URL Based Assistant
source: URL Search
pt_br: Busca p/ URL
